flyghost/OneOS-V2.1.0/templates/hc32-common/replace/HC32F4/replace/HC32F46/board/startup/startup_hc32f46x_arm.s
;/******************************************************************************
;* Copyright (C) 2016, Huada Semiconductor Co.,Ltd All rights reserved.
;*
;* This software is owned and published by:
;* Huada Semiconductor Co.,Ltd ("HDSC").
;*
;* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
;* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
;*
;* This software contains source code for use with HDSC
;* components. This software is licensed by HDSC to be adapted only
;* for use in systems utilizing HDSC components. HDSC shall not be
;* responsible for misuse or illegal use of this software for devices not
;* supported herein. HDSC is providing this software "AS IS" and will
;* not be responsible for issues arising from incorrect user implementation
;* of the software.
;*
;* Disclaimer:
;* HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
;* REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
;* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
;* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
;* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
;* WARRANTY OF NONINFRINGEMENT.
;* HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
;* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
;* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
;* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
;* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
;* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
;* SAVINGS OR PROFITS,
;* EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
;* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
;* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
;* FROM, THE SOFTWARE.
;*
;* This software may be replicated in part or whole for the licensed use,
;* with the restriction that this Disclaimer and Copyright notice must be
;* included with each copy of this software, whether used in part or whole,
;* at all times.
;*/
;/*****************************************************************************/

;/*****************************************************************************/
;/*  Startup for ARM                                                          */
;/*  Version     V1.0                                                         */
;/*  Date        2018-10-13                                                     */
;/*  Target-mcu  HC32F46x                                                     */
;/*****************************************************************************/


; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00000400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp
___initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size       EQU     0x00000200

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
                EXPORT  ___initial_sp

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; Peripheral Interrupts
                DCD     IRQ000_Handler        ; IRQ000_Handler
                DCD     IRQ001_Handler        ; IRQ001_Handler
                DCD     IRQ002_Handler        ; IRQ002_Handler
                DCD     IRQ003_Handler        ; IRQ003_Handler
                DCD     IRQ004_Handler        ; IRQ004_Handler
                DCD     IRQ005_Handler        ; IRQ005_Handler
                DCD     IRQ006_Handler        ; IRQ006_Handler
                DCD     IRQ007_Handler        ; IRQ007_Handler
                DCD     IRQ008_Handler        ; IRQ008_Handler
                DCD     IRQ009_Handler        ; IRQ009_Handler
                DCD     IRQ010_Handler        ; IRQ010_Handler
                DCD     IRQ011_Handler        ; IRQ011_Handler
                DCD     IRQ012_Handler        ; IRQ012_Handler
                DCD     IRQ013_Handler        ; IRQ013_Handler
                DCD     IRQ014_Handler        ; IRQ014_Handler
                DCD     IRQ015_Handler        ; IRQ015_Handler
                DCD     IRQ016_Handler        ; IRQ016_Handler
                DCD     IRQ017_Handler        ; IRQ017_Handler
                DCD     IRQ018_Handler        ; IRQ018_Handler
                DCD     IRQ019_Handler        ; IRQ019_Handler
                DCD     IRQ020_Handler        ; IRQ020_Handler
                DCD     IRQ021_Handler        ; IRQ021_Handler
                DCD     IRQ022_Handler        ; IRQ022_Handler
                DCD     IRQ023_Handler        ; IRQ023_Handler
                DCD     IRQ024_Handler        ; IRQ024_Handler
                DCD     IRQ025_Handler        ; IRQ025_Handler
                DCD     IRQ026_Handler        ; IRQ026_Handler
                DCD     IRQ027_Handler        ; IRQ027_Handler
                DCD     IRQ028_Handler        ; IRQ028_Handler
                DCD     IRQ029_Handler        ; IRQ029_Handler
                DCD     IRQ030_Handler        ; IRQ030_Handler
                DCD     IRQ031_Handler        ; IRQ031_Handler
                DCD     IRQ032_Handler        ; IRQ032_Handler
                DCD     IRQ033_Handler        ; IRQ033_Handler
                DCD     IRQ034_Handler        ; IRQ034_Handler
                DCD     IRQ035_Handler        ; IRQ035_Handler
                DCD     IRQ036_Handler        ; IRQ036_Handler
                DCD     IRQ037_Handler        ; IRQ037_Handler
                DCD     IRQ038_Handler        ; IRQ038_Handler
                DCD     IRQ039_Handler        ; IRQ039_Handler
                DCD     IRQ040_Handler        ; IRQ040_Handler
                DCD     IRQ041_Handler        ; IRQ041_Handler
                DCD     IRQ042_Handler        ; IRQ042_Handler
                DCD     IRQ043_Handler        ; IRQ043_Handler
                DCD     IRQ044_Handler        ; IRQ044_Handler
                DCD     IRQ045_Handler        ; IRQ045_Handler
                DCD     IRQ046_Handler        ; IRQ046_Handler
                DCD     IRQ047_Handler        ; IRQ047_Handler
                DCD     IRQ048_Handler        ; IRQ048_Handler
                DCD     IRQ049_Handler        ; IRQ049_Handler
                DCD     IRQ050_Handler        ; IRQ050_Handler
                DCD     IRQ051_Handler        ; IRQ051_Handler
                DCD     IRQ052_Handler        ; IRQ052_Handler
                DCD     IRQ053_Handler        ; IRQ053_Handler
                DCD     IRQ054_Handler        ; IRQ054_Handler
                DCD     IRQ055_Handler        ; IRQ055_Handler
                DCD     IRQ056_Handler        ; IRQ056_Handler
                DCD     IRQ057_Handler        ; IRQ057_Handler
                DCD     IRQ058_Handler        ; IRQ058_Handler
                DCD     IRQ059_Handler        ; IRQ059_Handler
                DCD     IRQ060_Handler        ; IRQ060_Handler
                DCD     IRQ061_Handler        ; IRQ061_Handler
                DCD     IRQ062_Handler        ; IRQ062_Handler
                DCD     IRQ063_Handler        ; IRQ063_Handler
                DCD     IRQ064_Handler        ; IRQ064_Handler
                DCD     IRQ065_Handler        ; IRQ065_Handler
                DCD     IRQ066_Handler        ; IRQ066_Handler
                DCD     IRQ067_Handler        ; IRQ067_Handler
                DCD     IRQ068_Handler        ; IRQ068_Handler
                DCD     IRQ069_Handler        ; IRQ069_Handler
                DCD     IRQ070_Handler        ; IRQ070_Handler
                DCD     IRQ071_Handler        ; IRQ071_Handler
                DCD     IRQ072_Handler        ; IRQ072_Handler
                DCD     IRQ073_Handler        ; IRQ073_Handler
                DCD     IRQ074_Handler        ; IRQ074_Handler
                DCD     IRQ075_Handler        ; IRQ075_Handler
                DCD     IRQ076_Handler        ; IRQ076_Handler
                DCD     IRQ077_Handler        ; IRQ077_Handler
                DCD     IRQ078_Handler        ; IRQ078_Handler
                DCD     IRQ079_Handler        ; IRQ079_Handler
                DCD     IRQ080_Handler        ; IRQ080_Handler
                DCD     IRQ081_Handler        ; IRQ081_Handler
                DCD     IRQ082_Handler        ; IRQ082_Handler
                DCD     IRQ083_Handler        ; IRQ083_Handler
                DCD     IRQ084_Handler        ; IRQ084_Handler
                DCD     IRQ085_Handler        ; IRQ085_Handler
                DCD     IRQ086_Handler        ; IRQ086_Handler
                DCD     IRQ087_Handler        ; IRQ087_Handler
                DCD     IRQ088_Handler        ; IRQ088_Handler
                DCD     IRQ089_Handler        ; IRQ089_Handler
                DCD     IRQ090_Handler        ; IRQ090_Handler
                DCD     IRQ091_Handler        ; IRQ091_Handler
                DCD     IRQ092_Handler        ; IRQ092_Handler
                DCD     IRQ093_Handler        ; IRQ093_Handler
                DCD     IRQ094_Handler        ; IRQ094_Handler
                DCD     IRQ095_Handler        ; IRQ095_Handler
                DCD     IRQ096_Handler        ; IRQ096_Handler
                DCD     IRQ097_Handler        ; IRQ097_Handler
                DCD     IRQ098_Handler        ; IRQ098_Handler
                DCD     IRQ099_Handler        ; IRQ099_Handler
                DCD     IRQ100_Handler        ; IRQ100_Handler
                DCD     IRQ101_Handler        ; IRQ101_Handler
                DCD     IRQ102_Handler        ; IRQ102_Handler
                DCD     IRQ103_Handler        ; IRQ103_Handler
                DCD     IRQ104_Handler        ; IRQ104_Handler
                DCD     IRQ105_Handler        ; IRQ105_Handler
                DCD     IRQ106_Handler        ; IRQ106_Handler
                DCD     IRQ107_Handler        ; IRQ107_Handler
                DCD     IRQ108_Handler        ; IRQ108_Handler
                DCD     IRQ109_Handler        ; IRQ109_Handler
                DCD     IRQ110_Handler        ; IRQ110_Handler
                DCD     IRQ111_Handler        ; IRQ111_Handler
                DCD     IRQ112_Handler        ; IRQ112_Handler
                DCD     IRQ113_Handler        ; IRQ113_Handler
                DCD     IRQ114_Handler        ; IRQ114_Handler
                DCD     IRQ115_Handler        ; IRQ115_Handler
                DCD     IRQ116_Handler        ; IRQ116_Handler
                DCD     IRQ117_Handler        ; IRQ117_Handler
                DCD     IRQ118_Handler        ; IRQ118_Handler
                DCD     IRQ119_Handler        ; IRQ119_Handler
                DCD     IRQ120_Handler        ; IRQ120_Handler
                DCD     IRQ121_Handler        ; IRQ121_Handler
                DCD     IRQ122_Handler        ; IRQ122_Handler
                DCD     IRQ123_Handler        ; IRQ123_Handler
                DCD     IRQ124_Handler        ; IRQ124_Handler
                DCD     IRQ125_Handler        ; IRQ125_Handler
                DCD     IRQ126_Handler        ; IRQ126_Handler
                DCD     IRQ127_Handler        ; IRQ127_Handler
                DCD     IRQ128_Handler        ; IRQ128_Handler
                DCD     IRQ129_Handler        ; IRQ129_Handler
                DCD     IRQ130_Handler        ; IRQ130_Handler
                DCD     IRQ131_Handler        ; IRQ131_Handler
                DCD     IRQ132_Handler        ; IRQ132_Handler
                DCD     IRQ133_Handler        ; IRQ133_Handler
                DCD     IRQ134_Handler        ; IRQ134_Handler
                DCD     IRQ135_Handler        ; IRQ135_Handler
                DCD     IRQ136_Handler        ; IRQ136_Handler
                DCD     IRQ137_Handler        ; IRQ137_Handler
                DCD     IRQ138_Handler        ; IRQ138_Handler
                DCD     IRQ139_Handler        ; IRQ139_Handler
                DCD     IRQ140_Handler        ; IRQ140_Handler
                DCD     IRQ141_Handler        ; IRQ141_Handler
                DCD     IRQ142_Handler        ; IRQ142_Handler
                DCD     IRQ143_Handler        ; IRQ143_Handler

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


